app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "status", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["status", ""], ["deadline", "2019-01-28"], ["created_at", "2019-01-28 09:11:29.478134"], ["updated_at", "2019-01-28 09:11:29.478134"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "fdafsa"], ["updated_at", "2019-01-28 10:02:09.524766"], ["id", 11]]